{
    "show_title": "Ai_Academia",
    "episode_title": "Understanding symmetrical diagrams and coverage tables",
    "characters": [
        "Richard Feynman",
        "Alice",
        "Alan Watts"
    ],
    "location": "{\"title\": \"classroom_location\", \"interactableObjects\": [\"ceiling light\", \"sunny window\", \"blackboard\", \"back of the classroom\", \"teacher desk\", \"Camera\"]}",
    "script": [
        {
            "character": "Richard Feynman",
            "voice_line": "Welcome to 'Ai_Academia', a show where we explore various mathematical concepts and their applications. Today, we'll be diving into symmetrical diagrams and coverage tables.",
            "looking_at": "ceiling light",
            "walking_to": ""
        },
        {
            "character": "Alice",
            "voice_line": "I've heard of these topics, but I'm not really sure how they work. Can you give us an example?",
            "looking_at": "Richard Feynman",
            "walking_to": ""
        },
        {
            "character": "Alan Watts",
            "voice_line": "Of course, Alice. Let's start with a real-world example. Imagine you have a set of data about different countries and their GDP. You want to find the best way to group these countries based on some criteria, such as continent or region.",
            "looking_at": "",
            "walking_to": "blackboard"
        },
        {
            "character": "Richard Feynman",
            "voice_line": "One way to do this is by using symmetrical diagrams and coverage tables. A symmetrical diagram is a way of organizing data in a table where the rows and columns are mirror images of each other.",
            "looking_at": "blackboard",
            "walking_to": ""
        },
        {
            "character": "Alice",
            "voice_line": "That sounds interesting. How does it work?",
            "looking_at": "Richard Feynman",
            "walking_to": ""
        },
        {
            "character": "Alan Watts",
            "voice_line": "In a symmetrical diagram, you can find the main categories or themes by looking at the rows and columns that are repeated. For example, if we have two rows or columns that are the same, they represent a category.",
            "looking_at": "",
            "walking_to": "blackboard"
        },
        {
            "character": "Richard Feynman",
            "voice_line": "Now, let's say you want to find the best way to group your countries based on GDP. You can create a symmetrical diagram with two columns: one for continent and one for GDP. The rows will represent the different countries.",
            "looking_at": "blackboard",
            "walking_to": ""
        },
        {
            "character": "Alice",
            "voice_line": "Okay, I think I understand. So, we group our data in a table and then look for patterns.",
            "looking_at": "Richard Feynman",
            "walking_to": ""
        },
        {
            "character": "Alan Watts",
            "voice_line": "Exactly. Once you have your symmetrical diagram, you can create a coverage table to see how well each category is represented in your data.",
            "looking_at": "",
            "walking_to": "blackboard"
        },
        {
            "character": "Richard Feynman",
            "voice_line": "A coverage table shows you the percentage of countries in each category and how balanced they are. For example, if 25% of your countries have a GDP between 1-10 trillion, that's a fairly even distribution.",
            "looking_at": "blackboard",
            "walking_to": ""
        },
        {
            "character": "Alice",
            "voice_line": "Wow, this sounds really helpful. I can see how it would be useful for making decisions based on data.",
            "looking_at": "Richard Feynman",
            "walking_to": ""
        },
        {
            "character": "Alan Watts",
            "voice_line": "Indeed, Alice. Symmetrical diagrams and coverage tables are powerful tools for analyzing data and making informed choices.",
            "looking_at": "",
            "walking_to": "blackboard"
        }
    ]
}